comp-sci/theorem-provers/hol-light.org
#+TITLE: HOL Light
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2022-01-11T11:04:31-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Tuesday January 11, 2022 at 11:04AM

I've been thinking about implementing a [[file:hol.org][HOL]] kernel in Standard ML, just
for fun. HOL Light has an implementation in a [[https://github.com/jrh13/hol-light/blob/master/fusion.ml][tiny kernel]] about 396
lines long (excluding 128 blank lines and 148 comment lines, as of git
commit ~970121c~ on Sep 12, 2016).

* Get Started
:PROPERTIES:
:CUSTOM_ID: h-fc6974ee-5f2a-4ceb-8168-bf5d4586436c
:END:

I'm assuming you've downloaded and compiled HOL Light
successfully. Start up OCaml, then:

#+begin_src ocaml
# #use "hol.ml";;
#+end_src

This will load HOL Light into the OCaml repl. If you additionally want
to use ~miz3~ mode, you can then run:

#+begin_src ocaml
# #use "miz3/miz3.ml";;
#+end_src

There are also some [[https://github.com/gilith/hol-light-emacs][emacs macros]] written for HOL Light.

* Obtaining and Compiling
:PROPERTIES:
:CUSTOM_ID: h-b8966ca2-18ec-43d5-8343-19fe27ae5f15
:END:

- [[file:hol-light/compile.org][Compiling HOL Light]] has some gotchas

* Some Examples
:PROPERTIES:
:CUSTOM_ID: h-473abd86-2af4-4f98-86cc-f3c2a4815fdf
:END:

- [[https://github.com/jrh13/hol-light/blob/master/Library/grouptheory.ml][Library/grouptheory.ml]] is where some group theory is done

* References
:PROPERTIES:
:CUSTOM_ID: h-fccbb336-8af3-4f4a-8fcc-b08a2ac071ce
:END:

- HOL Light Reference ([[https://www.cl.cam.ac.uk/~jrh13/hol-light/reference.pdf][PDF]], [[https://www.cl.cam.ac.uk/~jrh13/hol-light/reference.html][HTML]])
- John Harrison, [[https://www.cl.cam.ac.uk/~jrh13/hol-light/tutorial_220.pdf][Tutorial]] for version 220 (although dated, still useful).
- Felix Breuer,
  [[http://blog.felixbreuer.net/2012/06/11/hol.html][Formal proof - first steps with HOL Light]]; blog post dated June 11, 2012.

** Neat Applications of HOL Light
:PROPERTIES:
:CUSTOM_ID: h-4253cf49-5f6a-42f8-83fb-fd8dfbc7c005
:END:

- O. Kunčar,\\
  "Reconstruction of the Mizar Type System in the HOL Light System".\\
  [[https://www21.in.tum.de/~kuncar/documents/kuncar-wds10.pdf][PDF]], 6 pages.
- Petros Papapanagiotou and Jacques Fleuriot,\\
  "Object-Level Reasoning with Logics Encoded in HOL Light".\\
  {{{arXiv(2101.03808)}}}, 17 pages
- Lawrence C. Paulson,\\
  "Formalising Mathematics in Simple Type Theory".\\
  {{{arXiv(1804.07860)}}}, 17 pages.
- Adnan Rashid and Osman Hasan,\\
  "Formalization of Lerch's Theorem using HOL Light".\\
  {{{arXiv(1806.03049)}}}, 30 pages.
- Chantal Keller, Benjamin Werner,\\
  "Importing HOL Light into Coq".\\
  [[https://hal.inria.fr/file/index/docid/520604/filename/itp10.pdf][inria-00520604]], 17 pages.

** Papers about implementation details
:PROPERTIES:
:CUSTOM_ID: h-5e7ea3c6-32ef-48d7-b64f-512e41f8b520
:END:

- Freek Wiedijk,\\
  "Stateless HOL".\\
  {{{arXiv(1103.3322)}}}, 15 pages.
- Ramana Kumar,\\
  "Self-compilation and self-verification".\\
  PhD Thesis, Cambridge 2017, [[http://www.sigplan.org/Awards/Dissertation/2017_kumar.pdf][PDF]]
  
** Other related references
:PROPERTIES:
:CUSTOM_ID: h-2cfc3dcf-a386-420a-bcc5-c063e36fe47f
:END:

- Ben Lynn, [[https://crypto.stanford.edu/~blynn/compiler/Hol.html][Let there be HOL Light]] for a code golf implementation of HOL Light
- Magnus O. Myreen, Scott Owens, and Ramana Kumar,\\
  "Steps Towards Verified Implementations of HOL Light".\\
  [[https://cakeml.org/itp13.pdf][PDF]], 6 pages, published in /Proc. ITP 2013/, pp.490--495.

** HOL in general
:PROPERTIES:
:CUSTOM_ID: h-915c5f4a-2917-4ce0-9be5-29b90b01affd
:END:

- William M. Farmer,\\
  "The Seven Virtues of Simple Type Theory".\\
  doi:[[https://doi.org/10.1016/j.jal.2007.11.001][10.1016/j.jal.2007.11.001]], 2008
- [[https://master.dl.sourceforge.net/project/hol/hol/kananaskis-3/kananaskis-3-description.pdf?viasf=1][The HOL System Description]] ([[https://github.com/HOL-Theorem-Prover/HOL/tree/develop/Manual/Description][LaTeX files]]), for HOL4
  