docs/comp-sci/theorem-provers/hol-light.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-02-23 Wed 13:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>HOL Light</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">HOL Light</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-fc6974ee-5f2a-4ceb-8168-bf5d4586436c">1. Get Started</a></li>
<li><a href="#h-b8966ca2-18ec-43d5-8343-19fe27ae5f15">2. Obtaining and Compiling</a></li>
<li><a href="#h-473abd86-2af4-4f98-86cc-f3c2a4815fdf">3. Some Examples</a></li>
<li><a href="#h-fccbb336-8af3-4f4a-8fcc-b08a2ac071ce">4. References</a>
<ul>
<li><a href="#h-4253cf49-5f6a-42f8-83fb-fd8dfbc7c005">4.1. Neat Applications of HOL Light</a></li>
<li><a href="#h-5e7ea3c6-32ef-48d7-b64f-512e41f8b520">4.2. Papers about implementation details</a></li>
<li><a href="#h-2cfc3dcf-a386-420a-bcc5-c063e36fe47f">4.3. Other related references</a></li>
<li><a href="#h-915c5f4a-2917-4ce0-9be5-29b90b01affd">4.4. HOL in general</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I've been thinking about implementing a <a href="hol.html">HOL</a> kernel in Standard ML, just
for fun. HOL Light has an implementation in a <a href="https://github.com/jrh13/hol-light/blob/master/fusion.ml">tiny kernel</a> about 396
lines long (excluding 128 blank lines and 148 comment lines, as of git
commit <code>970121c</code> on Sep 12, 2016).
</p>

<div id="outline-container-h-fc6974ee-5f2a-4ceb-8168-bf5d4586436c" class="outline-2">
<h2 id="h-fc6974ee-5f2a-4ceb-8168-bf5d4586436c"><span class="section-number-2">1</span> Get Started</h2>
<div class="outline-text-2" id="text-h-fc6974ee-5f2a-4ceb-8168-bf5d4586436c">
<p>
I'm assuming you've downloaded and compiled HOL Light
successfully. Start up OCaml, then:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"># #use "hol.ml";;
</pre>
</div>

<p>
This will load HOL Light into the OCaml repl. If you additionally want
to use <code>miz3</code> mode, you can then run:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"># #use "miz3/miz3.ml";;
</pre>
</div>

<p>
There are also some <a href="https://github.com/gilith/hol-light-emacs">emacs macros</a> written for HOL Light.
</p>
</div>
</div>

<div id="outline-container-h-b8966ca2-18ec-43d5-8343-19fe27ae5f15" class="outline-2">
<h2 id="h-b8966ca2-18ec-43d5-8343-19fe27ae5f15"><span class="section-number-2">2</span> Obtaining and Compiling</h2>
<div class="outline-text-2" id="text-h-b8966ca2-18ec-43d5-8343-19fe27ae5f15">
<ul class="org-ul">
<li><a href="hol-light/compile.html">Compiling HOL Light</a> has some gotchas</li>
</ul>
</div>
</div>

<div id="outline-container-h-473abd86-2af4-4f98-86cc-f3c2a4815fdf" class="outline-2">
<h2 id="h-473abd86-2af4-4f98-86cc-f3c2a4815fdf"><span class="section-number-2">3</span> Some Examples</h2>
<div class="outline-text-2" id="text-h-473abd86-2af4-4f98-86cc-f3c2a4815fdf">
<ul class="org-ul">
<li><a href="https://github.com/jrh13/hol-light/blob/master/Library/grouptheory.ml">Library/grouptheory.ml</a> is where some group theory is done</li>
</ul>
</div>
</div>

<div id="outline-container-h-fccbb336-8af3-4f4a-8fcc-b08a2ac071ce" class="outline-2">
<h2 id="h-fccbb336-8af3-4f4a-8fcc-b08a2ac071ce"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-h-fccbb336-8af3-4f4a-8fcc-b08a2ac071ce">
<ul class="org-ul">
<li>HOL Light Reference (<a href="https://www.cl.cam.ac.uk/~jrh13/hol-light/reference.pdf">PDF</a>, <a href="https://www.cl.cam.ac.uk/~jrh13/hol-light/reference.html">HTML</a>)</li>
<li>John Harrison, <a href="https://www.cl.cam.ac.uk/~jrh13/hol-light/tutorial_220.pdf">Tutorial</a> for version 220 (although dated, still useful).</li>
<li>Felix Breuer,
<a href="http://blog.felixbreuer.net/2012/06/11/hol.html">Formal proof - first steps with HOL Light</a>; blog post dated June 11, 2012.</li>
</ul>
</div>

<div id="outline-container-h-4253cf49-5f6a-42f8-83fb-fd8dfbc7c005" class="outline-3">
<h3 id="h-4253cf49-5f6a-42f8-83fb-fd8dfbc7c005"><span class="section-number-3">4.1</span> Neat Applications of HOL Light</h3>
<div class="outline-text-3" id="text-h-4253cf49-5f6a-42f8-83fb-fd8dfbc7c005">
<ul class="org-ul">
<li>O. Kunčar,<br>
"Reconstruction of the Mizar Type System in the HOL Light System".<br>
<a href="https://www21.in.tum.de/~kuncar/documents/kuncar-wds10.pdf">PDF</a>, 6 pages.</li>
<li>Petros Papapanagiotou and Jacques Fleuriot,<br>
"Object-Level Reasoning with Logics Encoded in HOL Light".<br>
<a href="https://arxiv.org/abs/2101.03808">arXiv:2101.03808</a>, 17 pages</li>
<li>Lawrence C. Paulson,<br>
"Formalising Mathematics in Simple Type Theory".<br>
<a href="https://arxiv.org/abs/1804.07860">arXiv:1804.07860</a>, 17 pages.</li>
<li>Adnan Rashid and Osman Hasan,<br>
"Formalization of Lerch's Theorem using HOL Light".<br>
<a href="https://arxiv.org/abs/1806.03049">arXiv:1806.03049</a>, 30 pages.</li>
<li>Chantal Keller, Benjamin Werner,<br>
"Importing HOL Light into Coq".<br>
<a href="https://hal.inria.fr/file/index/docid/520604/filename/itp10.pdf">inria-00520604</a>, 17 pages.</li>
</ul>
</div>
</div>

<div id="outline-container-h-5e7ea3c6-32ef-48d7-b64f-512e41f8b520" class="outline-3">
<h3 id="h-5e7ea3c6-32ef-48d7-b64f-512e41f8b520"><span class="section-number-3">4.2</span> Papers about implementation details</h3>
<div class="outline-text-3" id="text-h-5e7ea3c6-32ef-48d7-b64f-512e41f8b520">
<ul class="org-ul">
<li>Freek Wiedijk,<br>
"Stateless HOL".<br>
<a href="https://arxiv.org/abs/1103.3322">arXiv:1103.3322</a>, 15 pages.</li>
<li>Ramana Kumar,<br>
"Self-compilation and self-verification".<br>
PhD Thesis, Cambridge 2017, <a href="http://www.sigplan.org/Awards/Dissertation/2017_kumar.pdf">PDF</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-2cfc3dcf-a386-420a-bcc5-c063e36fe47f" class="outline-3">
<h3 id="h-2cfc3dcf-a386-420a-bcc5-c063e36fe47f"><span class="section-number-3">4.3</span> Other related references</h3>
<div class="outline-text-3" id="text-h-2cfc3dcf-a386-420a-bcc5-c063e36fe47f">
<ul class="org-ul">
<li>Ben Lynn, <a href="https://crypto.stanford.edu/~blynn/compiler/Hol.html">Let there be HOL Light</a> for a code golf implementation of HOL Light</li>
<li>Magnus O. Myreen, Scott Owens, and Ramana Kumar,<br>
"Steps Towards Verified Implementations of HOL Light".<br>
<a href="https://cakeml.org/itp13.pdf">PDF</a>, 6 pages, published in <i>Proc. ITP 2013</i>, pp.490&#x2013;495.</li>
</ul>
</div>
</div>

<div id="outline-container-h-915c5f4a-2917-4ce0-9be5-29b90b01affd" class="outline-3">
<h3 id="h-915c5f4a-2917-4ce0-9be5-29b90b01affd"><span class="section-number-3">4.4</span> HOL in general</h3>
<div class="outline-text-3" id="text-h-915c5f4a-2917-4ce0-9be5-29b90b01affd">
<ul class="org-ul">
<li>William M. Farmer,<br>
"The Seven Virtues of Simple Type Theory".<br>
doi:<a href="https://doi.org/10.1016/j.jal.2007.11.001">10.1016/j.jal.2007.11.001</a>, 2008</li>
<li><a href="https://master.dl.sourceforge.net/project/hol/hol/kananaskis-3/kananaskis-3-description.pdf?viasf=1">The HOL System Description</a> (<a href="https://github.com/HOL-Theorem-Prover/HOL/tree/develop/Manual/Description">LaTeX files</a>), for HOL4</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-02-23 Wed 13:07.</p>
</div>
</body>
</html>